tap "ctrlspice/otel-desktop-viewer"
tap "domq/gdb"
tap "equinix-labs/otel-cli"
tap "fsouza/prettierd"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "ms-jpq/sad"
tap "nextdns/tap"
tap "oven-sh/bun"
tap "supabase/tap"
# Asciicast to GIF converter
brew "agg"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Compression/decompression library aiming for high speed
brew "snappy"
# Code searching, linting, rewriting
brew "ast-grep"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Vector graphics library with cross-device output support
brew "cairo"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# TUI Git client inspired by Magit
brew "gitu"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Make JSON greppable
brew "gron"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Easy, fast, and beautiful database client for the terminal
brew "harlequin"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Rust implementation of Jsonnet language
brew "jrsonnet"
# Interactive environments for writing and running code
brew "jupyterlab"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Development kit for the Java programming language
brew "openjdk@21"
# Object-relational database system
brew "postgresql@14"
# Parse HTML at the command-line
brew "pup"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Interactive find and replace in the terminal
brew "scooter"
# Intuitive find & replace CLI
brew "sd"
# Fuzzy Finder in rust!
brew "sk"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# File synchronization tool
brew "unison"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# OpenTelemetry Desktop Viewer
brew "ctrlspice/otel-desktop-viewer/otel-desktop-viewer"
# OpenTelemetry command-line tool for sending events from shell scripts & similar environments
brew "equinix-labs/otel-cli/otel-cli"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Supabase CLI
brew "supabase/tap/supabase"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Terminal built on web technologies
cask "hyper"
# Open-source keystroke visualiser
cask "keycastr"
# Break time reminder app
cask "lookaway"
# Todo manager based on the todo.txt syntax
cask "sleek-app"
# Record screen and camera time lapses in a menu bar interface
cask "timelapze"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
vscode "aaron-bond.better-comments"
vscode "abdelhakakermi.cursorchat-downloader"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mattpocock.ts-error-translator"
vscode "ms-playwright.playwright"
vscode "specstory.specstory-vscode"
vscode "stylelint.vscode-stylelint"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
