tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "ms-jpq/sad"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Make JSON greppable
brew "gron"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for SQLite
brew "sqlite"
# Cross-shell prompt for astronauts
brew "starship"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# GPU-accelerated terminal emulator
cask "alacritty"
